it/src/Catalogs/ОсновныеСредства/ОсновныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОсновныеСредства</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПрограммы</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОсновногоСредства</name>
    <type>
      <types>CatalogRef.ВидыОсновногоСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

it/src/Documents/ПоступлениеОС/ПоступлениеОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеОС</name>
  <registerRecords>AccumulationRegister.РазмещениеОбъектов</registerRecords>
  <registerRecords>InformationRegister.ПоддержкаЛицензий</registerRecords>
  <registerRecords>AccumulationRegister.ЛицензииОрганизации</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияОС</registerRecords>
  <registerRecords>InformationRegister.ОтключенныеКомпьютеры</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеОС</registerRecords>
  <registerRecords>AccumulationRegister.Закупки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговораКонтрагентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СведенияОС</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>МОЛ</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.Помещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ОСВладелец</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяДомена</name>
      <type>
        <types>CatalogRef.ИдентификаторыДоменов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

it/src/Catalogs/ВидыОсновногоСредства/ВидыОсновногоСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОсновногоСредства</name>
  <predefined>
    <items>
      <name>Железо</name>
      <description>Железо</description>
    </items>
    <items>
      <name>Лицензия</name>
      <description>Лицензия</description>
    </items>
    <items>
      <name>ПерсональныйКомпьютер</name>
      <description>Персональный компьютер</description>
    </items>
    <items>
      <name>ПрограммноеОбеспечение</name>
      <description>Программное обеспечение</description>
    </items>
    <items>
      <name>ПродлениеПоддержкиПО</name>
      <description>Продление поддержки ПО</description>
    </items>
  </predefined>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
</mdclass:Catalog>

it/src/Catalogs/ОсновныеСредства/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ...
// СтандартныеПодсистемы.Свойства
 &НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ...
// СтандартныеПодсистемы.Свойства
&НаСервере
 Процедура ОбновитьЭлементыДополнительныхРеквизитов()
   УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
 КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, , "ГруппаДополнительныеРеквизиты");
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	ОпределитьДоступнность(ЭтаФорма);
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ТекстДокументПоступления = ЗаполнениеДокументовСервер.ТекстДокументаПоступления(
		Объект.Ссылка, 
		Неопределено, 
		Элементы.ТекстДокументПоступления,
		Объект.ВидОсновногоСредства <> Справочники.ВидыОсновногоСредства.Лицензия // НеТребуется
	);
	
	ПараметрыОпций = Новый Структура("ВидОсновногоСредства", Объект.ВидОсновногоСредства);
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыОпций);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
 Процедура ВидОсновногоСредстваПриИзменении(Элемент)
	 
	 ОбновитьЭлементыДополнительныхРеквизитов();
	 
	 ПараметрыОпций = Новый Структура("ВидОсновногоСредства", Объект.ВидОсновногоСредства);
	 УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыОпций);
	 
	 ОпределитьДоступнность(ЭтаФорма);
   
 КонецПроцедуры

&НаКлиенте
// Функция возвращает документ поступления для справочника ОсновныеСредства.
//
// Параметры:
//	Объект           			- ДанныеФормыСтруктура - Данные документа
//	Форма            			- Форма документа
//	Организация      			- СправочникСсылка.Организации - Организация, для которой формируется документ поступления
//	ТекстДокументПоступления 	- Строка - Текст, указанный в поле счет-фактура
//	Поле - ПолеФормы 			- Поле формы для документа поступления
//	НеТребуется      			- Булево - Истина - для справочника не требуется вводить документ поступления
//
Функция ВвестиДокументПоступления(Объект, Форма, Организация, ТекстДокументПоступления, Поле = Неопределено, НеТребуется = Ложь) Экспорт
	
	ДокументПоступления = Неопределено;
	Гиперссылка = Истина;
	ВводитьДокументПоступления = Не НеТребуется;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстДокументПоступления = ЗаполнениеДокументовСервер.ТекстДокументаПоступления(Объект.Ссылка, Организация, Неопределено, НеТребуется, Гиперссылка, ДокументПоступления);
	КонецЕсли;
	
	НовыйТекстДокументПоступления = "";
	Если Не ЗначениеЗаполнено(ДокументПоступления)
		И ВводитьДокументПоступления Тогда
		
		СтруктураОснование = Новый Структура("ОсновноеСредство", Объект.Ссылка);
		
		НовыйТекстДокументПоступления = ОткрытьФормуМодально("Документ.ПоступлениеОС.ФормаОбъекта", Новый Структура("Основание", СтруктураОснование));
		Если ПустаяСтрока(НовыйТекстДокументПоступления) Тогда
			НовыйТекстДокументПоступления = ЗаполнениеДокументовСервер.ТекстДокументаПоступления(Объект.Ссылка, Организация, Неопределено, НеТребуется, Гиперссылка);
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ДокументПоступления) Тогда
			НовыйТекстДокументПоступления = ОткрытьФормуМодально("Документ.ПоступлениеОС.ФормаОбъекта", Новый Структура("Ключ", ДокументПоступления));
			Если ПустаяСтрока(НовыйТекстДокументПоступления) Тогда
				НовыйТекстДокументПоступления = ЗаполнениеДокументовСервер.ТекстДокументаПоступления(Объект.Ссылка, Организация, Неопределено, НеТребуется, Гиперссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(НовыйТекстДокументПоступления) Тогда
		ТекстДокументПоступления = НовыйТекстДокументПоступления;
	КонецЕсли;
	
	Если Поле <> Неопределено Тогда
		Если Поле.Гиперссылка <> Гиперссылка Тогда
			Поле.Гиперссылка = Гиперссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстДокументПоступления;
	
КонецФункции // ВвестиДокументПоступления

&НаКлиенте
 Процедура ТекстДокументПоступленияНажатие(Элемент, СтандартнаяОбработка)
	 
	СтандартнаяОбработка = Ложь;
	
	//ТекстДокументПоступления = ЗаполнениеДокументовСервер.ВвестиДокументПоступления(
	ТекстДокументПоступления = ВвестиДокументПоступления(
		Объект,
		ЭтаФорма,
		//Объект.Организация,
		Неопределено,
		ТекстДокументПоступления
	);
	 
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОпределитьДоступнность(Форма)

	ДоступностьРеквизитовПерсональныйКомпьютер = Форма.Объект.ВидОсновногоСредства = ПредопределенноеЗначение("Справочник.ВидыОсновногоСредства.ПерсональныйКомпьютер");
	Форма.Элементы.Отключен.Доступность  = ДоступностьРеквизитовПерсональныйКомпьютер;

КонецПроцедуры
